In [1]:
import pandas as pd

In [2]:
data={'name':['Alice','Bob','Charlie'],'age':[5,6,3]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df['gender']='Male'

In [5]:
df.head()

      name  age gender
0    Alice    5   Male
1      Bob    6   Male
2  Charlie    3   Male

In [6]:
import numpy as np

In [7]:
df.loc[3]=['Hero',np.nan,'Male']

In [8]:
df.head()

      name  age gender
0    Alice  5.0   Male
1      Bob  6.0   Male
2  Charlie  3.0   Male
3     Hero  NaN   Male

In [9]:
df.isna()

    name    age  gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False   True   False

In [10]:
df.loc[0,'gender']=np.nan

In [11]:
df.head()

      name  age gender
0    Alice  5.0    NaN
1      Bob  6.0   Male
2  Charlie  3.0   Male
3     Hero  NaN   Male

# Method: fillna

In [12]:
df['age'].fillna(26)

0     5.0
1     6.0
2     3.0
3    26.0
Name: age, dtype: float64

In [13]:
df.head()

      name  age gender
0    Alice  5.0    NaN
1      Bob  6.0   Male
2  Charlie  3.0   Male
3     Hero  NaN   Male

In [14]:
df['age'].fillna(6,inplace=True)

In [15]:
df.head()

      name  age gender
0    Alice  5.0    NaN
1      Bob  6.0   Male
2  Charlie  3.0   Male
3     Hero  6.0   Male

In [16]:
df.gender.fillna('Female',inplace=True)

In [17]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1      Bob  6.0    Male
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [18]:
df.loc[1,'gender']=np.nan

In [19]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1      Bob  6.0     NaN
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [20]:
df.dropna()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [21]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1      Bob  6.0     NaN
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [22]:
df.dropna(inplace=True)

In [23]:
df.head()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [24]:
df.drop('gender',axis=1)

      name  age
0    Alice  5.0
2  Charlie  3.0
3     Hero  6.0

In [25]:
df.head()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [26]:
df.drop(3,axis=0)

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male

In [27]:
df.head()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [29]:
df.reset_index().drop('index',axis=1)

      name  age  gender
0    Alice  5.0  Female
1  Charlie  3.0    Male
2     Hero  6.0    Male

In [30]:
df.head()

      name  age  gender
0    Alice  5.0  Female
2  Charlie  3.0    Male
3     Hero  6.0    Male

In [33]:
df.reset_index(drop=True,inplace=True)

In [34]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1  Charlie  3.0    Male
2     Hero  6.0    Male

In [35]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

# reseting column name

In [40]:
col_maper={'name': 'nam', 'age':'umer'}

In [43]:
df.rename(columns=col_maper)

       nam  umer  gender
0    Alice   5.0  Female
1  Charlie   3.0    Male
2     Hero   6.0    Male

In [44]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1  Charlie  3.0    Male
2     Hero  6.0    Male

# applying function

In [46]:
def double(x):
    return x*2

In [47]:
df['age'].apply(double)

0    10.0
1     6.0
2    12.0
Name: age, dtype: float64

# Grouped

In [51]:
df.head()

      name  age  gender
0    Alice  5.0  Female
1  Charlie  3.0    Male
2     Hero  6.0    Male

In [52]:
group=df.groupby('gender')

In [53]:
group

# Aggregate

In [55]:
group.agg({"age":"mean"})

        age
gender
Female  5.0
Male    4.5

# Calculus

In [ ]:
1. 
2. Differentiation and Integration

In [1]:
!pip install sympy

Collecting sympy
  Downloading sympy-1.12-py3-none-any.whl (5.7 MB)
                                              0.0/5.7 MB ? eta -:--:--
                                              0.0/5.7 MB ? eta -:--:--
                                              0.0/5.7 MB ? eta -:--:--
                                              0.0/5.7 MB 262.6 kB/s eta 0:00:22
                                              0.1/5.7 MB 409.6 kB/s eta 0:00:14
                                              0.1/5.7 MB 658.7 kB/s eta 0:00:09
     -                                        0.2/5.7 MB 892.5 kB/s eta 0:00:07
     -                                        0.3/5.7 MB 1.1 MB/s eta 0:00:06
     --                                       0.4/5.7 MB 1.4 MB/s eta 0:00:04
     ---                                      0.5/5.7 MB 1.6 MB/s eta 0:00:04
     ----                                     0.6/5.7 MB 1.6 MB/s eta 0:00:04
     ----                                     0.6/5.7 MB 1.7 MB/s eta 0:00:03
     ----                                     0.6/5.7 MB 1.7 MB/s eta 0:00:03
     ----                                     0.6/5.7 MB 1.7 MB/s eta 0:00:03
     ----                                     0.6/5.7 MB 1.7 MB/s eta 0:00:03
     -------                                  1.0/5.7 MB 1.9 MB/s eta 0:00:03
     -------                                  1.1/5.7 MB 1.8 MB/s eta 0:00:03
     -------                                  1.1/5.7 MB 1.9 MB/s eta 0:00:03
     --------                                 1.2/5.7 MB 1.8 MB/s eta 0:00:03
     ---------                                1.3/5.7 MB 1.9 MB/s eta 0:00:03
     ----------                               1.4/5.7 MB 2.0 MB/s eta 0:00:03
     ----------                               1.5/5.7 MB 2.0 MB/s eta 0:00:03
     -----------                              1.7/5.7 MB 2.1 MB/s eta 0:00:02
     ------------                             1.8/5.7 MB 2.2 MB/s eta 0:00:02
     --------------                           2.1/5.7 MB 2.3 MB/s eta 0:00:02
     ---------------                          2.2/5.7 MB 2.4 MB/s eta 0:00:02
     ----------------                         2.4/5.7 MB 2.5 MB/s eta 0:00:02
     -----------------                        2.6/5.7 MB 2.5 MB/s eta 0:00:02
     ------------------                       2.6/5.7 MB 2.6 MB/s eta 0:00:02
     ------------------                       2.7/5.7 MB 2.5 MB/s eta 0:00:02
     -------------------                      2.8/5.7 MB 2.5 MB/s eta 0:00:02
     --------------------                     3.0/5.7 MB 2.6 MB/s eta 0:00:02
     ---------------------                    3.1/5.7 MB 2.7 MB/s eta 0:00:01
     ----------------------                   3.3/5.7 MB 2.7 MB/s eta 0:00:01
     -----------------------                  3.4/5.7 MB 2.7 MB/s eta 0:00:01
     -------------------------                3.6/5.7 MB 2.8 MB/s eta 0:00:01
     --------------------------               3.8/5.7 MB 2.8 MB/s eta 0:00:01
     ---------------------------              4.0/5.7 MB 2.9 MB/s eta 0:00:01
     ----------------------------             4.1/5.7 MB 3.0 MB/s eta 0:00:01
     -----------------------------            4.2/5.7 MB 3.0 MB/s eta 0:00:01
     ------------------------------           4.4/5.7 MB 3.0 MB/s eta 0:00:01
     --------------------------------         4.6/5.7 MB 3.1 MB/s eta 0:00:01
     ---------------------------------        4.8/5.7 MB 3.1 MB/s eta 0:00:01
     ----------------------------------       4.9/5.7 MB 3.1 MB/s eta 0:00:01
     -----------------------------------      5.1/5.7 MB 3.2 MB/s eta 0:00:01
     ------------------------------------     5.2/5.7 MB 3.2 MB/s eta 0:00:01
     -------------------------------------    5.3/5.7 MB 3.2 MB/s eta 0:00:01
     --------------------------------------   5.5/5.7 MB 3.2 MB/s eta 0:00:01
     ---------------------------------------  5.7/5.7 MB 3.2 MB/s eta 0:00:01
     ---------------------------------------  5.7/5.7 MB 3.2 MB/s eta 0:00:01
     ---------------------------------------  5.7/5.7 MB 3.2 MB/s eta 0:00:01
     ---------------------------------------- 5.7/5.7 MB 3.1 MB/s eta 0:00:00
Collecting mpmath>=0.19 (from sympy)
  Downloading mpmath-1.3.0-py3-none-any.whl (536 kB)
                                              0.0/536.2 kB ? eta -:--:--
     -------                                112.6/536.2 kB 3.3 MB/s eta 0:00:01
     ---------------------                  297.0/536.2 kB 3.7 MB/s eta 0:00:01
     -------------------------------        450.6/536.2 kB 4.0 MB/s eta 0:00:01
     -------------------------------------  532.5/536.2 kB 4.2 MB/s eta 0:00:01
     -------------------------------------- 536.2/536.2 kB 3.4 MB/s eta 0:00:00
Installing collected packages: mpmath, sympy
Successfully installed mpmath-1.3.0 sympy-1.12

[notice] A new release of pip is available: 23.1 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import sympy as sp

In [3]:
x=sp.symbols('x')
f=(x**2 - 1)/(x-1)
limit=sp.limit(f,x,1)
limit

2

# Derivative

In [4]:
x=sp.symbols('x')
f=sp.sin(x)
dfdx=sp.diff(f,x)
dfdx

cos(x)